first_routes_controllers/app/controllers/artworks_controller.rb

    def index
        incoming_id = params[:user_id]
        user = User.find(incoming_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]