first_routes_controllers/app/controllers/comments_controller.rb

    def index

        if params[:author_id] != nil
            user = User.find(params[:author_id])
            render json: user.comments
        else
            artwork = Artwork.find(params[:artwork_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]